def get_posts_all():
    """возвращает посты"""
    pass


def get_posts_by_user(user_name):
    """
    возвращает посты определенного пользователя. Функция должна вызывать ошибку `ValueError`
    если такого пользователя нет и пустой список, если у пользователя нет постов.
    """
    pass


def get_comments_by_post_id(post_id):
    """
    возвращает комментарии определенного поста. Функция должна вызывать ошибку `ValueError`,
     если такого поста нет и пустой список, если у поста нет комментов.
     """
    pass


def search_for_posts(query):
    """возвращает список постов по ключевому слову"""
    pass


def get_post_by_pk(pk):
    """возвращает один пост по его идентификатору."""
    pass